gotoco/lowPowerFreeRtos/Drivers/STM32L1xx_HAL_Driver/stm32l1xx_hal_flash_ex.cpp
  if(status == HAL_OK)
  {
    if(TypeProgram == TYPEPROGRAMDATA_FASTBYTE)
    {
      /*Program word (8-bit) at a specified address.*/
      FLASH_DATAEEPROM_FastProgramByte(Address, (uint8_t) Data);
    }
    
    if(TypeProgram == TYPEPROGRAMDATA_FASTHALFWORD)
    {
      /*Program word (16-bit) at a specified address.*/
      FLASH_DATAEEPROM_FastProgramHalfWord(Address, (uint16_t) Data);
    }    
    
    if(TypeProgram == TYPEPROGRAMDATA_FASTWORD)
    {
      /*Program word (32-bit) at a specified address.*/
      FLASH_DATAEEPROM_FastProgramWord(Address, (uint32_t) Data);
    }
    
    if(TypeProgram == TYPEPROGRAMDATA_WORD)
    {
      /*Program word (32-bit) at a specified address.*/
      FLASH_DATAEEPROM_ProgramWord(Address, (uint32_t) Data);
    }
       
    if(TypeProgram == TYPEPROGRAMDATA_HALFWORD)
    {
      /*Program word (16-bit) at a specified address.*/
      FLASH_DATAEEPROM_ProgramHalfWord(Address, (uint16_t) Data);
    }
        
    if(TypeProgram == TYPEPROGRAMDATA_BYTE)
    {
      /*Program word (8-bit) at a specified address.*/
      FLASH_DATAEEPROM_ProgramByte(Address, (uint8_t) Data);
    }
    
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation((uint32_t)HAL_FLASH_TIMEOUT_VALUE);
  }
  
  /* Process Unlocked */
  __HAL_UNLOCK(&ProcFlash);

  return status;
}

/**
  * @brief  Enable DATA EEPROM fixed Time programming (2*Tprog).
  * @retval None
  */
void HAL_FLASHEx_DATAEEPROM_EnableFixedTimeProgram(void)
{
  SET_BIT(FLASH->PECR, FLASH_PECR_FTDW);
}

/**
  * @brief  Disables DATA EEPROM fixed Time programming (2*Tprog).
  * @retval None
  */
void HAL_FLASHEx_DATAEEPROM_DisableFixedTimeProgram(void)
{
  CLEAR_BIT(FLASH->PECR, FLASH_PECR_FTDW);
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup FLASHEx_Private_Functions FLASHEx Private functions
  * @{
  */

/*
==============================================================================
              ##### FLASH STATIC functions ##### 
==============================================================================
*/

/*
==============================================================================
              FLASH
==============================================================================
*/

/**
  * @brief  Set the specific FLASH error flag.
  * @retval None
  */
static void FLASH_SetErrorCode(void)
{ 
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_WRPERR) != RESET)
  {
   ProcFlash.ErrorCode = FLASH_ERROR_WRP;
  }
  
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_PGAERR) != RESET)
  {
   ProcFlash.ErrorCode |= FLASH_ERROR_PGA;
  }
  
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_SIZERR) != RESET)
  {
    ProcFlash.ErrorCode |= FLASH_ERROR_SIZE;
  }
  
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_OPTVERR) != RESET)
  {
    ProcFlash.ErrorCode |= FLASH_ERROR_OPTV;
  }
  
#if defined (STM32L151xBA) || defined (STM32L152xBA) || \
    defined (STM32L151xC) || defined (STM32L152xC) || defined (STM32L162xC)
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_RDERR) != RESET)
  {
    ProcFlash.ErrorCode |= FLASH_ERROR_RD;
  }
#endif /* STM32L151xBA || STM32L152xBA || STM32L151xC || STM32L152xC || STM32L162xC */

#if defined(STM32L100xC) || defined (STM32L151xC) || defined (STM32L152xC) || defined (STM32L162xC) || \
    defined(STM32L151xCA) || defined (STM32L151xD) || defined (STM32L152xCA) || defined (STM32L152xD) || defined (STM32L162xCA) || defined (STM32L162xD) || \
    defined(STM32L151xE) || defined (STM32L152xE) || defined (STM32L162xE)
  if(__HAL_FLASH_GET_FLAG(FLASH_FLAG_OPTVERRUSR) != RESET)
  {
    ProcFlash.ErrorCode |= FLASH_ERROR_OPTVUSR;
  }
#endif /* STM32L100xC || STM32L151xC || STM32L152xC || STM32L162xC || STM32L151xCA || STM32L151xD || STM32L152xCA || STM32L152xD || STM32L162xCA || STM32L162xD || STM32L151xE || STM32L152xE || STM32L162xE */
}

/**
  * @brief  Erases a specified page in program memory.
  * @param  PageAddress: The page address in program memory to be erased.
  * @note   A Page is erased in the Program memory only if the address to load 
  *         is the start address of a page (multiple of 256 bytes).
  * @retval None
  */
static void FLASH_ErasePage(uint32_t PageAddress)
{
  /* Set the ERASE bit */
  SET_BIT(FLASH->PECR, FLASH_PECR_ERASE);

  /* Set PROG bit */
  SET_BIT(FLASH->PECR, FLASH_PECR_PROG);

  /* Write 00000000h to the first word of the program page to erase */
  *(__IO uint32_t *)PageAddress = 0x00000000;
}
  

/*
==============================================================================
              OPTIONS BYTES
==============================================================================
*/
/**
  * @brief  Enables or disables the read out protection.
  * @note   To correctly run this function, the HAL_FLASH_OB_Unlock() function
  *         must be called before.
  * @param  OB_RDP: specifies the read protection level. 
  *   This parameter can be:
  *     @arg OB_RDP_LEVEL0: No protection
  *     @arg OB_RDP_LEVEL1: Read protection of the memory
  *     @arg OB_RDP_LEVEL2: Chip protection
  * 
  *  !!!Warning!!! When enabling OB_RDP_LEVEL2 it's no more possible to go back to level 1 or 0
  *   
  * @retval HAL status
  */
static HAL_StatusTypeDef FLASH_OB_RDPConfig(uint8_t OB_RDP)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tmp1 = 0, tmp2 = 0, sprmod = 0;
  
  /* Check the parameters */
  assert_param(IS_OB_RDP(OB_RDP));
  
  /* According to errata sheet, DocID022054 Rev 5, par2.1.5
  Before setting Level0 in the RDP register, check that the current level is not equal to Level0.
  If the current level is not equal to Level0, Level0 can be activated.
  If the current level is Level0 then the RDP register must not be written again with Level0. */
  tmp1 = (uint32_t)(OB->RDP & 0x000000FF);
  
  if ((tmp1 == OB_RDP_LEVEL0) && (OB_RDP == OB_RDP_LEVEL0))
  {
    /*current level is Level0 then the RDP register must not be written again with Level0. */
    status = HAL_ERROR;
  }
  else 
  {
    /* Mask SPRMOD bit */
    sprmod = (uint32_t)(OB->RDP & 0x00000100);

    status = FLASH_WaitForLastOperation(HAL_FLASH_TIMEOUT_VALUE);
    
